UbiquityRobotics/Arduino/hardware/ubiquity/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

bus_beaglebone.name=Ubiquity bus_beaglebone

bus_beaglebone.upload.tool=avrdude
bus_beaglebone.upload.protocol=arduino
bus_beaglebone.upload.maximum_size=32256
bus_beaglebone.upload.maximum_data_size=2048
bus_beaglebone.upload.speed=115200

bus_beaglebone.bootloader.tool=avrdude
bus_beaglebone.bootloader.low_fuses=0xFF
bus_beaglebone.bootloader.high_fuses=0xDE
bus_beaglebone.bootloader.extended_fuses=0x05
bus_beaglebone.bootloader.unlock_bits=0x3F
bus_beaglebone.bootloader.lock_bits=0x0F
bus_beaglebone.bootloader.file=optiboot/optiboot_atmega328.hex

bus_beaglebone.build.mcu=atmega324p
bus_beaglebone.build.f_cpu=16000000L
bus_beaglebone.build.board=AVR_BUS_BEAGLEBONE
bus_beaglebone.build.core=arduino
bus_beaglebone.build.variant=atmega324p

##############################################################

bus_bridge_encoders_sonar.name=Ubiquity bus_bridge_encoders_sonar

bus_bridge_encoders_sonar.upload.tool=avrdude
bus_bridge_encoders_sonar.upload.protocol=arduino
bus_bridge_encoders_sonar.upload.maximum_size=32256
bus_bridge_encoders_sonar.upload.maximum_data_size=2048
bus_bridge_encoders_sonar.upload.speed=115200

bus_bridge_encoders_sonar.bootloader.tool=avrdude
bus_bridge_encoders_sonar.bootloader.low_fuses=0xFF
bus_bridge_encoders_sonar.bootloader.high_fuses=0xDE
bus_bridge_encoders_sonar.bootloader.extended_fuses=0x05
bus_bridge_encoders_sonar.bootloader.unlock_bits=0x3F
bus_bridge_encoders_sonar.bootloader.lock_bits=0x0F
bus_bridge_encoders_sonar.bootloader.file=optiboot/optiboot_atmega328.hex

bus_bridge_encoders_sonar.build.mcu=atmega328p
bus_bridge_encoders_sonar.build.f_cpu=16000000L
bus_bridge_encoders_sonar.build.board=AVR_BUS_BRIDGE_ENCODERS_SONAR
bus_bridge_encoders_sonar.build.core=arduino
bus_bridge_encoders_sonar.build.variant=standard

##############################################################

bus_sonar10.name=Ubiquity bus_sonar10

bus_sonar10.upload.tool=avrdude
bus_sonar10.upload.protocol=arduino
bus_sonar10.upload.maximum_size=32256
bus_sonar10.upload.maximum_data_size=2048
bus_sonar10.upload.speed=115200

bus_sonar10.bootloader.tool=avrdude
bus_sonar10.bootloader.low_fuses=0xFF
bus_sonar10.bootloader.high_fuses=0xDE
bus_sonar10.bootloader.extended_fuses=0x05
bus_sonar10.bootloader.unlock_bits=0x3F
bus_sonar10.bootloader.lock_bits=0x0F
bus_sonar10.bootloader.file=optiboot/optiboot_atmega328.hex

bus_sonar10.build.mcu=atmega328p
bus_sonar10.build.f_cpu=16000000L
bus_sonar10.build.board=AVR_BUS_SONAR10
bus_sonar10.build.core=arduino
bus_sonar10.build.variant=standard

##############################################################

mega.name=Ubiquity bus_loki

mega.vid.0=0x2341
mega.pid.0=0x0010
mega.vid.1=0x2341
mega.pid.1=0x0042

mega.upload.tool=avrdude
mega.upload.maximum_data_size=8192

mega.bootloader.tool=avrdude
mega.bootloader.low_fuses=0xFF
mega.bootloader.unlock_bits=0x3F
mega.bootloader.lock_bits=0x0F

mega.build.f_cpu=16000000L
mega.build.core=arduino
mega.build.variant=mega
# default board  may be overridden by the cpu menu
mega.build.board=AVR_MEGA2560

## Arduino Mega w/ ATmega2560
## -------------------------
mega.menu.cpu.atmega2560=ATmega2560 (Mega 2560)

mega.menu.cpu.atmega2560.upload.protocol=wiring
mega.menu.cpu.atmega2560.upload.maximum_size=253952
mega.menu.cpu.atmega2560.upload.speed=115200

mega.menu.cpu.atmega2560.bootloader.high_fuses=0xD8
mega.menu.cpu.atmega2560.bootloader.extended_fuses=0xFD
mega.menu.cpu.atmega2560.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

mega.menu.cpu.atmega2560.build.mcu=atmega2560
mega.menu.cpu.atmega2560.build.board=AVR_MEGA2560

## Arduino Mega w/ ATmega1280
## -------------------------
mega.menu.cpu.atmega1280=ATmega1280

mega.menu.cpu.atmega1280.upload.protocol=arduino
mega.menu.cpu.atmega1280.upload.maximum_size=126976
mega.menu.cpu.atmega1280.upload.speed=57600

mega.menu.cpu.atmega1280.bootloader.high_fuses=0xDA
mega.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
mega.menu.cpu.atmega1280.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex

mega.menu.cpu.atmega1280.build.mcu=atmega1280
mega.menu.cpu.atmega1280.build.board=AVR_MEGA

##############################################################

bus_raspberry_pi.name=Ubiquity bus_raspberry_pi

bus_raspberry_pi.upload.tool=avrdude
bus_raspberry_pi.upload.protocol=arduino
bus_raspberry_pi.upload.maximum_size=32256
bus_raspberry_pi.upload.maximum_data_size=2048
bus_raspberry_pi.upload.speed=115200

bus_raspberry_pi.bootloader.tool=avrdude
bus_raspberry_pi.bootloader.low_fuses=0xFF
bus_raspberry_pi.bootloader.high_fuses=0xDE
bus_raspberry_pi.bootloader.extended_fuses=0x05
bus_raspberry_pi.bootloader.unlock_bits=0x3F
bus_raspberry_pi.bootloader.lock_bits=0x0F
bus_raspberry_pi.bootloader.file=optiboot/optiboot_atmega328.hex

bus_raspberry_pi.build.mcu=atmega324p
bus_raspberry_pi.build.f_cpu=16000000L
bus_raspberry_pi.build.board=AVR_BUS_RASPBERRY_PI
bus_raspberry_pi.build.core=arduino
bus_raspberry_pi.build.variant=atmega324p

